function Car(name,price,img,w,car,country,js){
  this.name = name;
  this.price = price;
  this.img = img;
  this.w = w;
  this.car = car;
  this.country =country;
  this.js = js;
}

let BTsy = new Car('本田思域','10.38-15.79万','carImg/car/本田思域.png','B',"轿车","日本",'全新CIVIC思域Hatchback_上场即控场');
let HFh6 = new Car('哈佛H6','06.90-13.47万','carImg/car/哈佛H6.png','H',"SUV","中国",'第三代哈弗H6基于全新平台打造,采用东方式未来设计理念,并在智能、安全上实现全面突破！');
let RCxy = new Car('日产轩逸','08.78-13.90万','carImg/car/日产轩逸.png','R','轿车',"日本",'会思考,会呼吸,会沟通,日产智行将让汽车成为你的智能出行伙伴,与你一起智造惊喜,共享更兴奋、更美好的生活。');
let BTcrv = new Car('本田CR-V','15.28-26.08万','carImg/car/本田CR-V.png','B','SUV',"日本",'本田CR-V是东风本田汽车公司生产的一款城市经典SUV车型，2015款CR-V主打运动时尚的设计外观，操控性能极佳。');
let BTyage = new Car('本田雅阁','16.98-24.48万','carImg/car/本田雅阁.png','B',"轿车","日本",'第十代雅阁用美学挑逗你的感官！让动力唤醒你的热血！以科技带你探索未知！邀你共赴好奇之旅。');
let BM3x = new Car('宝马3系','27.63-38.94万','carImg/car/宝马3系.png','B','轿车','德国','宝马3系是宝马集团新一代轿车产品，车身重量1465千克，直列4缸汽油发动机，车型尺寸为4.734米，1.811米，1.455米。');
let DZly = new Car('大众朗逸','07.49-13.69万','carImg/car/大众朗逸.png','D','轿车','德国','全新一代朗逸,采用大众全球新一代设计语言,尺寸空间全面提升,带来越级驾乘体验。');
let FTkll = new Car('丰田卡罗拉','10.98-14.98万','carImg/car/丰田卡罗拉.png','F','轿车',"日本",'第12代全新卡罗拉，基于TNGA丰巢概念打造，全球4800万车主的信赖，智能配置再次升级，为爱行我路，My Way！');
let DZst = new Car('大众速腾','07.89-14.17万','carImg/car/大众速腾.png','D','轿车','德国','一汽-大众速腾始终保持强大的市场号召力，至今已八年蝉联A+级三厢车的市场冠军。');
let FTkmr = new Car('丰田凯美瑞','17.68-27.18万','carImg/car/丰田凯美瑞.png','F','轿车',"日本",'凯美瑞全新家族升级TNGA2.5L双擎混动/2.5L/2.0L 3种动力总成、豪华/运动2种风格外观、新增豪华棕色内饰。');
let BCcj = new Car('奔驰C级','25.28-42.98万','carImg/car/奔驰c级.png','B','轿车','德国','购享0首付36期"先享后选",运动设计,闪钻格栅,锋芒尽显,成就人生主角.');
let LK03 = new Car('领克03','10.68-24.88万','carImg/car/领克03.png','L','轿车',"中国",'领克03是领克品牌第一款轿车产品，也是CMA基础模块架构打造的第一款轿车。');
let DZmt = new Car('大众迈腾','15.69-27.99万','carImg/car/大众迈腾.png','D','轿车','德国','大众迈腾源自和帕萨特B6关系紧密的FutureB6，这也是一汽-大众建厂以来将要生产和销售的第一款B级轿车。');
let CAyd = new Car('长安逸动','06.67-09.79万','carImg/car/长安逸动.png','C','轿车',"中国",'逸动（EADO）是长安汽车全球研发团队历时三年精心打造的一款具有国际化水平的全球战略车型。');
let MZD3 = new Car('马自达3 昂克塞拉','11.29-16.59万','carImg/car/马自达3昂克塞拉.png','M','轿车','日本','车身尺寸方面,新车的长宽高分别为4662/1797/1445mm,轴距为2726mm,');
let KDLKct4 = new Car('凯迪拉克CT4','19.97-21.97万','carImg/car/凯迪拉克CT4.png','K','轿车','美国','凯迪拉克跳过CT4,直接上CT4-V?日前,凯迪拉克旗下全新中型车——凯迪拉克CT4-V亮相');
let DZyl = new Car('别克英朗','08.19-09.59万','carImg/car/别克英朗.png','D','轿车','美国','懂你追求的进化,也懂你难舍的情怀.2021款别克英朗1.3T+48V轻混动携英朗典范1.5L 全新上市。');
let FTyzl = new Car('丰田亚洲龙','19.18-28.18万','carImg/car/丰田亚洲龙.png','F','轿车',"日本",'运大智，勇于颠覆；琢细美，不断求精。一汽丰田TNGA旗舰车型，“智·美双极”亚洲龙');
let BTxrv = new Car('本田XR-V','10.59-15.39万','carImg/car/本田XR-V.png','B','SUV',"日本",'东风本田团购展厅店,针对旗下XR-V系车型给出了最高3.5万元的综合优惠,店内现车充足');
let DZty = new Car('大众途岳','13.58-19.38万','carImg/car/大众途岳.png','D','SUV','德国','上汽大众途岳。攀登者何以不断抵达新境，以山岳气势，方能纵横人生征途。');
let QYk5 = new Car('起亚K5凯酷','16.18-20.58万','carImg/car/起亚K5凯酷.png','Q','轿车','韩国','凯酷（ALL NEW K5）唤世来袭，Z世代酷感科技座驾，包牌指导价：16.18-20.58万元，现在购车即可酷享7重礼！');
let MJ6 = new Car('名爵6','08.18-13.48万','carImg/car/名爵6.png','M','轿车',"中国",'名爵6车,名爵6好吗,名爵的mg6,力擎广州市最低价格,名爵特卖会,震撼底价来袭');
let HQh9 = new Car('红旗H9','30.98-53.93万','carImg/car/红旗H9.png','H','轿车',"中国",'与创领者同行，共抵格局之上。 红旗H9 新时代C+级豪华旗舰轿车，震撼上市，售价30.98万元-53.98万元！');
let FThld = new Car('丰田汉兰达','23.98-32.58万','carImg/car/丰田汉兰达.png','F','SUV',"日本",'豪华大中型7座SUV汉兰达,高价值更保值, TSS智行安全套装带来高规格安全保护,全方位车身静谧设计,尽享舒适之旅。');

let WLrg = new Car('五菱荣光','02.98-04.38万','carImg/car/五菱荣光.png','W','微面','中国','五菱荣光系列,包括五菱荣光V、五菱荣光S、五菱荣光加长版、荣光单双排。预约试驾五菱荣光系列微车,查询五菱荣光系列价格与优惠信息,欢迎访问上汽通用五菱官方网站!')
let CAp = new Car('长安炮','09.98-20.38万','carImg/car/炮.png','C','皮卡','中国','爱卡汽车炮频道为您提供炮2020年最新款、车型报价图片,参数配置,养车费用,空间舒适度,经销商推荐等资讯内容,')
let CAsqt10 = new Car('长安神骐T10','03.98-05.38万','carImg/car/神骐T10.png','C','微卡','中国','易车提供全国官方4S店神骐T10报价,最新长安凯程神骐T10降价优惠信息以及神骐T10报价,神骐T10图片, 神骐T10在线询价服务,低价买车尽在易车')
let WLhg = new Car('五菱宏光','04.08-06.38万','carImg/car/五菱宏光.png','W','微面','中国','爱卡汽车五菱宏光频道为您提供五菱宏光2020年最新款、车型报价图片,参数配置,养车费用,空间舒适度,经销商推荐等资讯内容,更多五菱宏光2020年最新款,五菱宏光最新报价...')
let BKgl8 = new Car('别克GL8','23.98-52.38万','carImg/car/别克GL8.png','B','MPV','美国','以GL8之名,以礼相待.别克GL8家族,打造MPV经典,全面升级造型设计、舒适配置、安全保护、互联科技,树立MPV新标准.')
let CQm6 = new Car('传奇M6','10.98-15.38万','carImg/car/传奇M6.png','C','MPV','中国','爱卡汽车炮频道为您提供炮2020年最新款、车型报价图片,参数配置,养车费用,空间舒适度,经销商推荐等资讯内容,')
let FTf150 = new Car('福特F-150','55.20-57.38万','carImg/car/福特F-150.png','F','皮卡','美国','1988年一汽与奥迪开始合作,已为超过500万中国用户带来高品质的汽车生活和服务体验.旗下有e-tron,A8L等产品.')
let FTxsdqs = new Car('福特新世代全顺','16.98-24.89万','carImg/car/福特新世代全顺.png','F','微面','美国','以GL8之名,以礼相待.别克GL8家族,打造MPV经典,全面升级造型设计、舒适配置、安全保护、互联科技,树立MPV新标准.')
let JLjj = new Car('吉利嘉际','08.98-15.38万','carImg/car/吉利嘉际.png','J','MPV','中国','爱卡汽车炮频道为您提供炮2020年最新款、车型报价图片,参数配置,养车费用,空间舒适度,经销商推荐等资讯内容,')
let WLkj = new Car('五菱凯捷Victory','43.98-45.38万','carImg/car/凯捷Victory.png','W','MPV','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLrgEV = new Car('五菱荣光EV','07.98-08.38万','carImg/car/五菱荣光EV.png','W','微面','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLrgxk = new Car('五菱荣光小卡','02.98-04.38万','carImg/car/五菱荣光小卡.png','W','微卡','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLrgxink = new Car('五菱荣光新卡','04.98-05.38万','carImg/car/五菱荣光新卡.png','W','微卡','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLrgxkykq = new Car('五菱荣光新卡翼开启','06.98-8.38万','carImg/car/五菱荣光新卡翼开启.png','W','微卡','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLzgxk = new Car('五菱之光小卡','02.98-04.38万','carImg/car/五菱之光小卡.png','W','微卡','中国','汽车之家五菱荣光小卡频道,提供五菱荣光小卡报价,五菱汽车在售五菱荣光小卡图片,五菱汽车全部五菱荣光小卡参数配置,五菱荣光小卡最新文章,保养周期及费用等最新信息,精彩...')
let WLxhsx30 = new Car('金杯小海狮X30','03.98-04.38万','carImg/car/小海狮X30.png','J','微面','中国','易车提供全国官方4S店金杯小海狮X30报价,最新华晨鑫源金杯小海狮X30降价优惠信息以及金杯小海狮X30报价,')
let CAv3 = new Car('长安V3','03.98-05.38万','carImg/car/长安V3.png','C','微面','中国','卡车之家为您提供全面的长安V3,经销商V3报价,二手V3价格,V3图片,V3配置(参数),V3论坛等内容。')
let CAfj5 = new Car('长安风骏5','06.98-08.38万','carImg/car/长安风骏5.png','C','皮卡','中国','汽车之家风骏5频道,提供风骏5报价,长城在售风骏5图片,长城全部风骏5参数配置,风骏5最新文章,保养周期及费用等最新信息,最精彩风骏5汽车内容尽在汽车之家')

let ADa6l = new Car('奥迪A6L','33.98-55.38万','carImg/car/奥迪A6L.png','A','轿车','德国','1988年一汽与奥迪开始合作,已为超过500万中国用户带来高品质的汽车生活和服务体验.旗下有e-tron,A8L等产品.')
let ADa4l = new Car('奥迪A4L','25.38-34.18万','carImg/car/奥迪A4L.png','A','轿车','德国','1988年一汽与奥迪开始合作,已为超过500万中国用户带来高品质的汽车生活和服务体验.旗下有e-tron,A8L等产品.')
let ADa3 = new Car('奥迪A3','16.37-19.91万','carImg/car/奥迪A3.png','A','轿车','德国','奥迪品牌首款纯电动车型，让我们一道翻开属于奥迪，更属于您的崭新一页。');
let ADq5l = new Car('奥迪Q5L','31.48-40.30万','carImg/car/奥迪Q5L.png','A','SUV','德国','北京车展前瞻丨全新奥迪Q5L Sportback将全球首发');
let ADq3 = new Car('奥迪Q3',"22.58-31.58万",'carImg/car/奥迪Q3.png',"A",'SUV','德国','奥迪Q3 2020年型心无所限 奥迪Q3 2020年型拥有更加个性化的外观更加伶俐的线条');
let ADa7 = new Car('奥迪A7','53.88-67.68万','carImg/car/奥迪A7.png','A','轿车','德国','全新奥迪A7拥有着更加俊朗的造型,相比上一代车型,本代奥迪A7更加的有棱角,个性化十足,每个人的审美不同,');
let ADa5 = new Car('奥迪A5','34-68-51-88万','carImg/car/奥迪A5.png','A','轿车','德国','奥迪A5 Coupé在中国推出舒适型、进去型以及45 TFSI quattro车型,并提供包括车内外配色,轮毂样式以及配置等诸多选择方案。');
let ADa8 = new Car('奥迪A8','67.18-93.2万','carImg/car/奥迪A8.png','A','轿车','德国','2021款奥迪A8正式上市,新车共推出4款车型,售价区间为84.28万-119.88万元。');
let ADq2l = new Car('奥迪Q2L','16.88-21.25万','carImg/car/奥迪Q2L.png','A','SUV','德国','汽车奥迪q2l,q2l款,广州市奥迪特卖会,团购即会,降价促销,厂家特卖,');
let ADq7 = new Car('奥迪Q7','65.25-85.55万','carImg/car/奥迪Q7.png','A','SUV','德国','肌肉感十足的轮眉搭配超大的轮毂、地平线尾灯辅以大尺寸排气孔造型,全新奥迪Q7重新定义硬派风范。');
let ADs4 = new Car('奥迪S4','45.95万','carImg/car/奥迪S4.png','A','轿车','德国','s4 limousine-全新奥迪S4 谦逊低调的运动奢华');
let ADs3 = new Car('奥迪S3','32.39万','carImg/car/奥迪S3.png','A','轿车','德国','外观变化最明显的就是前脸了,新款奥迪A3车型的前脸造型采用了奥迪最新的家族式设计风格,配六边形进气格栅,');
let ADq8 = new Car('奥迪Q8','71.38-98.88万','carImg/car/奥迪Q8.png','A','SUV','德国','20款奥迪Q8由7种不同驾驶模式包括越野模式 在越野状态下 如果是自适应空气悬挂版本将底MI显示器上 ');
let ADr8 = new Car('奥迪R8','195.28-229.98万','carImg/car/奥迪R8.png','A','跑车','德国','R8 RS e-tron A3 Sportback A3 Sportback 奥迪A3 Sportback 2020年型输出功率可达110 kW');
let ADrs5 = new Car('奥迪RS5','84.67-86-98万','carImg/car/奥迪RS5.png','A','跑车','德国','2020奥迪rs5 coupe-全新奥迪RS 5 Coupe是刹那 更是永恒');
let ADs5 = new Car('奥迪S5','62.27-69.87万','carImg/car/奥迪S5.png','A','轿车','德国','奥迪s5 coupe-全新奥迪S5 Coupe_见颜·见智');
let ADrs6 = new Car('奥迪RS6','135.78万','carImg/car/奥迪RS6.png','A','SUV','德国','奥迪rs6 2020款-奥迪RS 6 Avant 唯强者竞速风行');
let ADtt = new Car('奥迪TT','35.36-46.66万','carImg/car/奥迪TT.png','A','跑车','德国','爱卡汽车奥迪TT双门频道为您提供奥迪TT双门2020年最新款');
let ADrs3 = new Car('奥迪RS3','51.38万','carImg/car/奥迪RS3.png','A','轿车','德国','有海外媒体拍摄到全新一代奥迪RS 3 路试的谍照,新车目前正在德国纽博格林赛道进行底盘测试,');
let ADrs4 = new Car('奥迪RS4','82.28万','carImg/car/奥迪RS4.png','A','跑车','德国','奥迪rs4 avant-全新奥迪RS 4 Avant 岂止是致命吸引');

let BMm8 = new Car('宝马M8','196.35-256.70万','carImg/car/宝马M8.png','B','轿车','德国','宝马M8的上市给宝马汽车品牌注入了新的元素,');
let BMm2 = new Car('宝马M2','60.03-61.6万','carImg/car/宝马M2.png','B','SUV','德国','高阶版本达450马力!新一代奥迪RS3全面超越宝马M2');
let BMm3 = new Car('宝马M3','60.03-61.6万','carImg/car/宝马M2.png','B','SUV','德国','宝马M3/M4将会在9月23日正式发布,并会在北京车展期间亮相。');
let BMz4 = new Car('宝马Z4','48.55-63.55万','carImg/car/宝马Z4.png','B','跑车','德国','z4宝马 - 全新BMW Z4敞篷跑车 所到之处 你就是焦点.');
let BMx6 = new Car('宝马X6','76.69-93.2万','carImg/car/宝马X6.png','B','SUV','德国','宝马 x6 - 全新BMW X6游弋天地 闪耀而来.即刻预约试驾');
let BM8x = new Car('宝马8系','96.55-126.55万','carImg/car/宝马8系.png','B','轿车','德国','宝马8系-全新BMW 8系四门轿跑车_享5年超长贷款期限');
let BMx2 = new Car('宝马X2','20.28-25.2万','carImg/car/宝马X2.png','B','轿车','德国','华晨宝马官方宣布,新款X2正式上市,共推出4款配置车型,售价26.68-32.98万元。');
let BMx7 = new Car('宝马X7','100.02-178.80万','carImg/car/宝马X7.png','B','SUV','德国','x7 bmw - 创新BMW X7 澎湃性能 旗舰魅力');
let BM2x = new Car('宝马2系','25.06-32.28万','carImg/car/宝马2系.png','B','跑车','德国','宝马2系Coupe最新谍照 疑似M245i车型/2021年下半年亮相');
let BMx5 = new Car('宝马X5','68.56-84.99万','carImg/car/宝马X5.png','B','SUV','德国','宝马x5 - 精致尊贵 雄心匹配 BMW官方商城邀您体验');
let BM7x = new Car('宝马7系','69.25-199.12万','carImg/car/宝马7系.png','B','SUV','德国','宝马7系 - 新BMW 7系 内外兼修 成就磅礴风范');
let BMx1 = new Car('宝马X1','21.29-27.86万','carImg/car/宝马X1.png','B','SUV','德国','【新款宝马X1上市:配置提升,27.98万元起售】新款宝马X1车型已正式上市,新车搭载1.5T三缸、2.0T四缸两款发动机');
let BM4x = new Car('宝马4系','34.36-58.66万','carImg/car/宝马4系.png','B','轿车','德国','4系宝马 - 全新BMW 4系双门 相约北京车展 欢迎莅临');
let BM1x = new Car('宝马1系','14.75-20.5万','carImg/car/宝马1系.png','B','轿车','德国','让RAV4荣放甘拜下风!合资20万元的宝马1系性价比超高');
let BMx3 = new Car('宝马X3','35.25-44.14万','carImg/car/宝马X3.png','B','SUV','德国','2021款新宝马X3,是不是值得期待的豪华中型SUV');
let BM5x = new Car('宝马5系','38.00-50.00万','carImg/car/宝马5系.png','B','轿车','德国','新款落地便有优惠?全新宝马5系即将上市,配置升级远超...');
let BMx4 = new Car('宝马X4','43.77-56.55万','carImg/car/宝马X4.png','B','SUV','德国','x4宝马-新BMW X4 时尚前卫由内而外 澎湃驾趣始终如一');
let BMi8 = new Car('宝马I8','146.25-176.66万','carImg/car/宝马I8.png','B','跑车','德国','i8宝马-BMW i8 X 易烊千玺 让驾趣永远炽热.');
let BMx4m = new Car('宝马X4m','86.12-95.3万','carImg/car/宝马X4.png','B','SUV','德国','宝马x4 4s店 - BMW售后服务 为悦常伴');
let BM3xgt = new Car('宝马3系GT','31.31-38.32万','carImg/car/宝马3系.png','B','轿车','德国','宝马3系gt-BMW 3系GT 轿跑外形 灵感肆放 悦享BMW金融优惠');



let car  = [
  BTsy,HFh6,RCxy,BTcrv,BTyage,BM3x,DZly,FTkll,DZst,FTkmr,BCcj,
  LK03,DZmt,CAyd,MZD3,KDLKct4,DZyl,FTyzl,BTxrv,DZty,QYk5,MJ6,HQh9,FThld,
  ADa6l,ADa4l,ADa3,ADq5l,ADq3,ADa7,ADa5,ADa8,ADq2l,ADq7,ADs4,ADs3,ADq8,ADr8,ADrs5,ADs5,ADrs6,ADtt,ADrs3,ADrs4,
  BMm8,BMm2,BMm3,BMz4,BMx6,BM8x,BMx2,BMx7,BM2x,BMx5,BM7x,BMx1,BM4x,BM1x,BMx3,BM5x,BMx4,BMi8,BMx4m,BM3xgt,
  WLrg,CAp,CAsqt10,WLhg,BKgl8,CQm6,FTf150,FTxsdqs,JLjj,WLkj,WLrgEV,WLrgxk,WLrgxink,WLrgxkykq,WLzgxk,WLxhsx30,CAv3,CAfj5,
]

